FSI/cylinderFlap/OpenFOAM-CalculiX/Fluid/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location constant;
    object transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


    materialName air;
    transportModel Newtonian;
    NewtonianCoeffs
    {
    }

    rho rho [1 -3 0 0 0 0 0 ] 1000.0;
    // mu mu [1 -1 -1 0 0 0 0 ] 1.;
    nu nu [0 2 -1 0 0 0 0 ] 0.001;
    // Cp Cp [0 2 -2 -1 0 0 0 ] 1006.0;
    // Prt Prt [0 0 0 0 0 0 0 ] 0.85;
    // lambda lambda [1 1 -3 -1 0 0 0 ] 0.024;
    pRef pRef [1 -1 -2 0 0 0 0 ] 0.0;
    // TRef TRef [0 0 0 1 0 0 0 ] 300.0;
    // beta beta [0 0 0 -1 0 0 0 ] 0.00333;
    // Pr Pr [0 0 0 0 0 0 0 ] 0.9;
    // Cp0 Cp0 [0 0 0 1 0 0 0 ] 1006.0;
    // rhoCp0 1.205;
