FSI/cylinderFlap/OpenFOAM-CalculiX/Fluid/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

    cylinder
    {
        type            noSlip;
    }    

    flap
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }

    top
    {
        type            noSlip;
    }

    bottom
    {
        type            noSlip;
    }

    inlet
    {
        type            uniformFixedValue;
        uniformValue    table 
                        ( 
                            ( 0 ( 0 0 0 ) ) 
                            ( 2. ( 2. 0 0 ) ) 
                            ( 100 ( 2. 0 0 ) ) 
                        );
    }

    outlet
    {
        type            zeroGradient;
    }

    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}

// ************************************************************************* //
